Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.GetPicker Method
 Gets a picker for picking points and objects in a drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Picker GetPicker()
Public Function GetPicker As Picker
Return Value
Type: Picker
A picker object if the drawing editor is open. Otherwise null.
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace